# -*- coding: utf8 -*-
from saText import parse_saText

conll_text = '2_astafiev_zhizn_prozhit.conll'
sent_arr = [[['1', 'Хозяин', 'хозяин', 'N', 'N', 'Ncmsny', '2', 'предик', '_', '_', '4737'], ['2', 'сидит', 'сидеть', 'V', 'V', 'Vmip3s-a-e', '0', 'ROOT', '_', '_', '4744'], ['3', 'на', 'на', 'S', 'S', 'Sp-l', '2', '1-компл', '_', '_', '4751'], ['4', 'скамейке', 'скамейка', 'N', 'N', 'Ncfsln', '3', 'предл', '_', '_', '4754'], ['5', 'ножка', 'ножка', 'N', 'N', 'Ncfsnn', '2', 'сочин', '_', '_', '4763'], ['6', 'на', 'на', 'S', 'S', 'Sp-a', '5', 'атриб', '_', '_', '4769'], ['7', 'ножку', 'ножка', 'N', 'N', 'Ncfsan', '6', 'предл', '_', '_', '4772'], ['8', ',', ',', ',', ',', ',', '7', 'PUNC', '_', '_', '4777'], ['9', 'сложив', 'сложить', 'V', 'V', 'Vmgs---a-p', '2', 'обст', '_', '_', '4779'], ['10', 'их', 'они', 'P', 'P', 'P-3-pan', '9', '1-компл', '_', '_', '4786'], ['11', 'вроде', 'вроде', 'S', 'S', 'Sp-g', '9', 'атриб', '_', '_', '4789'], ['12', 'ножниц', 'ножницы', 'N', 'N', 'Ncfpgn', '11', 'предл', '_', '_', '4796'], ['13', 'и', 'и', 'C', 'C', 'C', '2', 'сочин', '_', '_', '4803'], ['14', 'вытянув', 'вытянуть', 'V', 'V', 'Vmgs---a-p', '13', 'соч-союзн', '_', '_', '4805'], ['15', 'насколько', 'насколько', 'R', 'R', 'R', '16', 'обст', '_', '_', '4814'], ['16', 'позволяет', 'позволять', 'V', 'V', 'Vmip3s-a-e', '2', 'изъясн', '_', '_', '4824'], ['17', 'не', 'не', 'Q', 'Q', 'Q', '18', 'огранич', '_', '_', '4835'], ['18', 'такая', 'такой', 'P', 'P', 'P--fsna', '21', 'опред', '_', '_', '4839'], ['19', 'уж', 'уж', 'Q', 'Q', 'Q', '18', 'огранич', '_', '_', '4845'], ['20', 'выразительная', 'выразительный', 'A', 'A', 'Afpfsnf', '21', 'опред', '_', '_', '4849'], ['21', 'длина', 'длина', 'N', 'N', 'Ncfsnn', '16', 'предик', '_', '_', '4863'], ['22', '.', '.', 'S', 'S', 'SENT', '21', 'PUNC', '_', '_', '4868']], [['1', 'Руки', 'рука', 'N', 'N', 'Ncfpnn', '4', 'обст', '_', '_', '4870'], ['2', 'он', 'он', 'P', 'P', 'P-3msnn', '4', 'предик', '_', '_', '4875'], ['3', 'отчего-то', 'отчего-то', 'R', 'R', 'R', '4', 'обст', '_', '_', '000'], ['4', 'держал', 'держать', 'V', 'V', 'Vmis-sma-e', '0', 'ROOT', '_', '_', '4888'], ['5', 'переплетенными', 'переплетеннымь', 'V', 'V', 'Vmn----a-e', '4', '2-компл', '_', '_', '4895'], ['6', 'на', 'на', 'S', 'S', 'Sp-n', '5', '1-компл', '_', '_', '4910'], ['7', 'груди', 'грудь', 'N', 'N', 'Ncfsnnl', '6', 'предл', '_', '_', '4914'], ['8', ',', ',', ',', ',', ',', '7', 'PUNC', '_', '_', '4919'], ['9', 'вроде', 'вроде', 'Q', 'Q', 'Q', '13', 'вводн', '_', '_', '4921'], ['10', 'бы', 'бы', 'Q', 'Q', 'Q', '9', 'вспом', '_', '_', '4927'], ['11', 'как', 'как', 'C', 'C', 'C', '13', 'сравнит', '_', '_', '4930'], ['12', 'грея', 'грея', 'N', 'N', 'Ncfsnn', '11', 'сравн-союзн', '_', '_', '4935'], ['13', 'пальцы', 'палец', 'N', 'N', 'Ncmpnn', '4', '1-компл', '_', '_', '4940'], ['14', 'под', 'под', 'S', 'S', 'Sp-i', '13', 'атриб', '_', '_', '4948'], ['15', 'мышками', 'мышка', 'N', 'N', 'Ncfpin', '14', 'предл', '_', '_', '4953'], ['16', ',', ',', ',', ',', ',', '15', 'PUNC', '_', '_', '4960'], ['17', '-', '-', '-', '-', '-', '15', 'PUNC', '_', '_', '4963'], ['18', 'поза', 'поза', 'N', 'N', 'Ncfsnn', '4', 'предик', '_', '_', '4966'], ['19', 'скорей', 'скорей', 'R', 'R', 'R', '20', 'огранич', '_', '_', '4972'], ['20', 'женская', 'женский', 'A', 'A', 'Afpfsnf', '4', 'суб-копр', '_', '_', '4979'], ['21', ',', ',', ',', ',', ',', '20', 'PUNC', '_', '_', '4986'], ['22', 'чем', 'чем', 'C', 'C', 'C', '19', 'сравнит', '_', '_', '4989'], ['23', 'мужская', 'мужской', 'A', 'A', 'Afpfsnf', '22', 'сравн-союзн', '_', '_', '4994'], ['24', '.', '.', 'S', 'S', 'SENT', '23', 'PUNC', '_', '_', '5001']], [['1', 'У', 'у', 'S', 'S', 'Sp-g', '4', 'обст', '_', '_', '5003'], ['2', 'Татьяны', 'татьяна', 'N', 'N', 'Npfsgy', '1', 'предл', '_', '_', '5006'], ['3', 'же', 'же', 'Q', 'Q', 'Q', '2', 'огранич', '_', '_', '5014'], ['4', 'Финогеновны', 'финогеновный', 'A', 'A', 'Afpmpns', '0', 'ROOT', '_', '_', '5017'], ['5', 'руки', 'рука', 'N', 'N', 'Ncfpnn', '4', 'предик', '_', '_', '5031'], ['6', 'обычно', 'обычно', 'R', 'R', 'R', '7', 'огранич', '_', '_', '5037'], ['7', 'в', 'в', 'S', 'S', 'Sp-l', '4', 'обст', '_', '_', '5045'], ['8', 'коленях', 'колено', 'N', 'N', 'Ncnpln', '7', 'предл', '_', '_', '5048'], ['9', ',', ',', ',', ',', ',', '8', 'PUNC', '_', '_', '5055'], ['10', 'ладошка', 'ладошка', 'N', 'N', 'Ncfsnn', '4', 'предик', '_', '_', '5058'], ['11', 'в', 'в', 'S', 'S', 'Sp-l', '10', 'атриб', '_', '_', '5067'], ['12', 'ладошке', 'ладошка', 'N', 'N', 'Ncfsln', '11', 'предл', '_', '_', '5070'], ['13', ',', ',', ',', ',', ',', '12', 'PUNC', '_', '_', '5077'], ['14', 'ноги', 'нога', 'N', 'N', 'Ncfpnn', '16', 'предик', '_', '_', '5080'], ['15', 'широко', 'широко', 'R', 'R', 'R', '16', 'обст', '_', '_', '5087'], ['16', 'расставлены', 'расставить', 'V', 'V', 'Vmps-p-psp', '4', 'сент-соч', '_', '_', '5094'], ['17', ',', ',', ',', ',', ',', '16', 'PUNC', '_', '_', '5105'], ['18', 'упористо', 'упористо', 'R', 'R', 'R', '16', 'сент-соч', '_', '_', '5107'], ['19', ',', ',', ',', ',', ',', '18', 'PUNC', '_', '_', '5115'], ['20', 'но', 'но', 'C', 'C', 'C', '18', 'сочин', '_', '_', '5117'], ['21', 'не', 'не', 'Q', 'Q', 'Q', '22', 'огранич', '_', '_', '5120'], ['22', 'часто', 'часто', 'R', 'R', 'R', '20', 'соч-союзн', '_', '_', '5123'], ['23', 'доводилось', 'доводиться', 'V', 'V', 'Vmis-snm-e', '4', 'вводн', '_', '_', '5129'], ['24', 'ей', 'она', 'P', 'P', 'P-3fsdn', '23', 'предик', '_', '_', '5140'], ['25', 'посидеть', 'посидеть', 'V', 'V', 'Vmn----a-p', '4', 'предик', '_', '_', '5143'], ['26', 'так', 'так', 'P', 'P', 'P-----r', '4', 'обст', '_', '_', '5152'], ['27', 'вот', 'вот', 'Q', 'Q', 'Q', '26', 'огранич', '_', '_', '5156'], ['28', ',', ',', ',', ',', ',', '27', 'PUNC', '_', '_', '5159'], ['29', 'вольно', 'вольно', 'R', 'R', 'R', '0', 'ROOT', '_', '_', '5161'], ['30', ',', ',', ',', ',', ',', '29', 'PUNC', '_', '_', '5167'], ['31', 'в', 'в', 'S', 'S', 'Sp-a', '0', 'ROOT', '_', '_', '5169'], ['32', 'свое', 'свой', 'P', 'P', 'P--nsaa', '33', 'опред', '_', '_', '5171'], ['33', 'удовольствие', 'удовольствие', 'N', 'N', 'Ncnsan', '31', 'предл', '_', '_', '5176'], ['34', '.', '.', 'S', 'S', 'SENT', '33', 'PUNC', '_', '_', '5188']], [['1', 'Как', 'как', 'C', 'C', 'C', '4', 'обст', '_', '_', '5190'], ['2', 'бы', 'бы', 'Q', 'Q', 'Q', '4', 'аналит', '_', '_', '5194'], ['3', 'нечаянно', 'нечаянно', 'R', 'R', 'R', '4', 'обст', '_', '_', '5197'], ['4', 'вцепившись', 'вцепиться', 'V', 'V', 'Vmgs---m-p', '0', 'ROOT', '_', '_', '5206'], ['5', 'в', 'в', 'S', 'S', 'Sp-a', '4', '1-компл', '_', '_', '5217'], ['6', 'скамейку', 'скамейка', 'N', 'N', 'Ncfsan', '5', 'предл', '_', '_', '5219'], ['7', ',', ',', ',', ',', ',', '6', 'PUNC', '_', '_', '5227'], ['8', 'опершись', 'опереться', 'V', 'V', 'Vmgs---m-p', '4', 'обст', '_', '_', '5229'], ['9', 'на', 'на', 'S', 'S', 'Sp-a', '8', '1-компл', '_', '_', '5239'], ['10', 'руки', 'рука', 'N', 'N', 'Ncfpan', '9', 'предл', '_', '_', '5242'], ['11', ',', ',', ',', ',', ',', '10', 'PUNC', '_', '_', '5246'], ['12', 'спеленатая', 'спеленатать', 'V', 'V', 'Vmgp---a-e', '8', 'обст', '_', '_', '5248'], ['13', 'болью', 'боль', 'N', 'N', 'Ncfsin', '12', '2-компл', '_', '_', '5260'], ['14', 'и', 'и', 'C', 'C', 'C', '13', 'сочин', '_', '_', '5267'], ['15', 'внутренним', 'внутренний', 'A', 'A', 'Afpnsif', '16', 'опред', '_', '_', '5270'], ['16', 'напряжением', 'напряжение', 'N', 'N', 'Ncnsin', '14', 'соч-союзн', '_', '_', '5282'], ['17', ',', ',', ',', ',', ',', '16', 'PUNC', '_', '_', '5293'], ['18', 'будто', 'будто', 'C', 'C', 'C', '12', '1-компл', '_', '_', '5296'], ['19', 'беспомощный', 'беспомощный', 'A', 'A', 'Afpmsnf', '20', 'опред', '_', '_', '5303'], ['20', 'младенец', 'младенец', 'N', 'N', 'Ncmsny', '23', 'пролепт', '_', '_', '5316'], ['21', 'пеленальником', 'пеленальник', 'N', 'N', 'Ncmsin', '20', 'атриб', '_', '_', '5325'], ['22', '-', '-', '-', '-', '-', '21', 'PUNC', '_', '_', '5340'], ['23', 'вот', 'вот', 'Q', 'Q', 'Q', '24', 'огранич', '_', '_', '5343'], ['24', 'как', 'как', 'P', 'P', 'P-----r', '28', 'обст', '_', '_', '5348'], ['25', 'она', 'она', 'P', 'P', 'P-3fsnn', '28', 'суб-копр', '_', '_', '5353'], ['26', 'последнее', 'последний', 'A', 'A', 'Afpnsaf', '27', 'опред', '_', '_', '5358'], ['27', 'время', 'время', 'N', 'N', 'Ncnsan', '28', 'предик', '_', '_', '5369'], ['28', 'сидела', 'сидеть', 'V', 'V', 'Vmis-sfa-e', '18', 'подч-союзн', '_', '_', '5376'], ['29', ':', ':', '-', '-', '-', '28', 'PUNC', '_', '_', '5382'], ['30', 'чаще', 'часто', 'R', 'R', 'Rc', '31', 'обст', '_', '_', '5386'], ['31', 'стало', 'стать', 'V', 'V', 'Vmis-sna-p', '28', 'изъясн', '_', '_', '5392'], ['32', 'ее', 'она', 'P', 'P', 'P-3fsan', '33', '1-компл', '_', '_', '5399'], ['33', 'схватывать', 'схватывать', 'V', 'V', 'Vmn----a-e', '31', '1-компл', '_', '_', '5402'], ['34', ',', ',', ',', ',', ',', '33', 'PUNC', '_', '_', '5412'], ['35', 'и', 'и', 'C', 'C', 'C', '31', 'сент-соч', '_', '_', '5414'], ['36', 'она', 'она', 'P', 'P', 'P-3fsnn', '37', 'предик', '_', '_', '5416'], ['37', 'боялась', 'бояться', 'V', 'V', 'Vmis-sfm-e', '35', 'соч-союзн', '_', '_', '5420'], ['38', 'упасть', 'упасть', 'V', 'V', 'Vmn----a-p', '37', '1-компл', '_', '_', '5428'], ['39', 'наземь', 'наземь', 'R', 'R', 'R', '38', 'обст', '_', '_', '5435'], ['40', '.', '.', 'S', 'S', 'SENT', '39', 'PUNC', '_', '_', '5441']], '32']
sent_arr_np = [[['1', 'Хозяин', '4737'], ['4', 'скамейке', '4754'], ['5', 'ножка', '4763', '6', 'на', '4769', '7', 'ножку', '4772'], ['7', 'ножку', '4772'], ['12', 'ножниц', '4796'], ['21', 'длина', '4863', '18', 'такая', '4839', '20', 'выразительная', '4849']], [['1', 'Руки', '4870'], ['7', 'груди', '4914'], ['12', 'грея', '4935'], ['13', 'пальцы', '4940', '9', 'вроде', '4921', '11', 'как', '4930', '14', 'под', '4948', '15', 'мышками', '4953'], ['15', 'мышками', '4953'], ['18', 'поза', '4966']], [['2', 'Татьяны', '5006'], ['5', 'руки', '5031'], ['8', 'коленях', '5048'], ['10', 'ладошка', '5058', '11', 'в', '5067', '12', 'ладошке', '5070'], ['12', 'ладошке', '5070'], ['14', 'ноги', '5080'], ['33', 'удовольствие', '5176', '32', 'свое', '5171']], [['6', 'скамейку', '5219'], ['10', 'руки', '5242'], ['13', 'болью', '5260', '14', 'и', '5267', '16', 'напряжением', '5282', '15', 'внутренним', '5270'], ['16', 'напряжением', '5282', '15', 'внутренним', '5270'], ['20', 'младенец', '5316', '19', 'беспомощный', '5303', '21', 'пеленальником', '5325'], ['21', 'пеленальником', '5325'], ['27', 'время', '5369', '26', 'последнее', '5358']]]
chains_arr = ['ее', [['Танькой', '9'], ['Татьяна Финогеновна', '52'], ['Татьяна Финогеновна', '1235'], ['Татьяна Финогеновна', '1915'], ['Татьяна Финогеновна', '1992'], ['Тани', '3944'], ['Татьяны Финогеновны', '3950'], ['Она', '3971'], ['ее', '4037'], ['Татьяна Финогеновна', '4603'], ['Татьяны же Финогеновны', '5006'], ['ей', '5140'], ['свое', '5171'], ['она', '5353'], ['ее', '5399'], ['она', '5416'], ['супругу', '5488'], ['Она', '5537'], ['Татьяна Финогеновна', '5675'], ['ей', '5781'], ['ей', '5856'], ['она', '5952']]]

def np_length(np):
    length_characters = 0
    length_words = 0
    for q in np[1::3]:
        length_characters += len(q)
        length_words += 1
    return length_characters, length_words

def np_distance(nps, np, s_number, a_id):
    dist_np = 0
    cut_nps = nps[s_number:]
    for q in range(len(cut_nps[-1])):
        word = cut_nps[-1][q]
        if int(word[0]) > int(a_id):
            cut_nps[-1] = cut_nps[-1][:q-1]
            break
    for q1 in range(len(cut_nps[0])):
        #print(len(cut_nps))
        word1 = cut_nps[0][q1]
        if word1[0] == np[0]:
            cut_nps[0] = cut_nps[0][q1:]
            break
    for s in cut_nps:
        dist_np += len(s)
    return dist_np
    #print(cut_nps)


#print(np_distance(sent_arr_np, ['12', 'грея', '11', 'как', '13', 'пальцы'], 1, 25))

def distance_np2pronoun(s, n, s_number, a_id): #snips, noun_phrase, number of sentence with np(-1), anaphora id
    dist_characters = 0
    dist_words = 0
    sents = s[s_number:]
    start = int(n[0])-1
    first_sent = sents[0]
    first_sent = first_sent[start:]
    sents[0] = first_sent
    last_sent = sents[-1]
    last_sent = last_sent[:int(a_id)-1]
    sents[-1] = last_sent
    for sent in sents:
        for word in sent:
            #word = word.split('\t')
            dist_characters += len(word[1])
            dist_words += 1
    return dist_characters, dist_words


#print(distance_np2pronoun(sent_arr[:-1], ['5', 'руки', '4', 'Финогеновны'], 2, 25))

def gram_agreement(s, np, s_number, a_id):
    gender = 0 #doesnt match
    number = 0
    ordinal_id = int(np[0])
    candidate_gram_info = s[s_number][ordinal_id-1]
    #candidate_gram_info = candidate_gram_info.split('\t')
    candidate_gram_info = candidate_gram_info[5]
    cand_gender = candidate_gram_info[2]
    cand_number = candidate_gram_info[3]
    pronoun_gram_info = s[-1][int(a_id)-1]
    #pronoun_gram_info = pronoun_gram_info.split('\t')
    pronoun_gram_info = pronoun_gram_info[5]
    pron_gender = pronoun_gram_info[3]
    pron_number = pronoun_gram_info[4]
    if cand_number == pron_number:
        number = 1
    if cand_gender == pron_gender:
        gender = 1
    return gender, number

def pronoun_info(s, a_id):
    perpronouns = ['он', 'она', 'оно', 'они', 'я', 'мой']
    refpronouns = ['свой', 'себе']
    relpronouns = ['который']
    pronoun_gram_info = s[-1][int(a_id)-1]
    #pronoun_gram_info = pronoun_gram_info.split('\t')
    pronoun_type = None
    if pronoun_gram_info[2] in perpronouns:
        pronoun_type = 'per'
    elif pronoun_gram_info[2] in refpronouns:
        pronoun_type = 'ref'
    elif pronoun_gram_info[2] in relpronouns:
        pronoun_type = 'rel'
    return pronoun_type

#gram_agreement(sent_arr[:-1],['33', 'удовольствие', '31', 'в', '32', 'свое'], 2, 25)

def noun_salience(conll_text, s, np, s_number):
    sentences = parse_saText(conll_text)
    salience_value = 0
    ordinal_id = int(np[0])
    lemma = s[s_number][ordinal_id-1]
    #lemma = lemma.split('\t')
    lemma = lemma[2]
    main_sent = s[s_number]
    for q in sentences:
        if q != main_sent:
            for word in q:
                #word = word.split('\t')
                lemma_info = word[2]
                if lemma_info == lemma:
                    salience_value += 1
        else:
            break
    return salience_value

#noun_salience('2_astafiev_zhizn_prozhit.conll', sent_arr[:-1], ['27', 'время', '26', 'последнее'], 3)

def target_value(np, chains):
    new_chains = []
    p = False
    target = 0
    for q in chains:

        #q = sorted(q)
        new_chains.append(q[1])
    new_np = np[2]
    #print(np[2])
    if new_np in new_chains:
        target = 1
        p = True
    return target, p







def get_features(sents, nps, conll_text, chains):
    vectors = []
    snips, anaph_id = sents[:-1], sents[-1]
    for s in range(len(nps)):
        for np in nps[s]:
            dbl = False
            if np[1] != "None":
                #print('1')
                vect = []
                len_ch, len_w = np_length(np)
                dist_ch, dist_w = distance_np2pronoun(snips, np, s, anaph_id)
                vect.append(len_ch)
                vect.append(len_w)
                vect.append(dist_ch)
                vect.append(dist_w)
                vect.append(np_distance(nps, np, s, anaph_id))
                gend, numb = gram_agreement(snips, np, s, anaph_id)
                vect.append(gend)
                vect.append(numb)
                vect.append(pronoun_info(snips, anaph_id))
                vect.append(noun_salience(conll_text, snips, np, s))
                target, db = target_value(np, chains)
                if db is True:
                    dbl = True
                vect.append(target)                                    #UNCOMMEND
                vectors.append(vect)
            if dbl is True:
                print('GOT IT')
    print('NEXT')
    return vectors



#p = get_features(sent_arr, sent_arr_np, conll_text, chains_arr[1])
#for q in p:
   # print(q)